app/controllers/api/v1/articles_controller.rb

      def index
        articles = Article.order('created_at DESC')
---
SELECT `articles`.* FROM `articles` ORDER BY created_at DESC

      def show
        article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 4 LIMIT 1

      def create
        article = Article.new(article_params)

        if article.save
---
INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`) VALUES ('test article one', 'test article body one', '2017-07-06 10:19:16', '2017-07-06 10:19:16')

      def destroy
        article = Article.find(params[:id])
        article.destroy
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 6 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 6

      def update
          article = Article.find(params[:id])

        if article.update_attributes(article_params)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 15 LIMIT 1
UPDATE `articles` SET `title` = 'updated title', `body` = 'updated body', `updated_at` = '2017-07-06 10:50:26' WHERE `articles`.`id` = 15